In [1]:
import pandas as pd

In [2]:
'l1, l2, l3, l4'.split()

['l1,', 'l2,', 'l3,', 'l4']

In [3]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [4]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [5]:
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [6]:
type(df['c1'])

pandas.core.series.Series

In [7]:
df[['c1', 'c3']]

    c1  c3
l1   1   3
l2   5   7
l3   8  11
l4  13  15

In [8]:
type(df[['c1', 'c3']])

pandas.core.frame.DataFrame

In [9]:
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [11]:
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [12]:
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [13]:
df[1:][['c1', 'c3']]

    c1  c3
l2   5   7
l3   8  11
l4  13  15

In [18]:
df.loc['l3']

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [19]:
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

In [20]:
df.loc['l1', 'c2']

2

In [21]:
df.iloc[0,1]

2

In [22]:
df.loc[['l3', 'l1'], ['c4','c1']]

    c4  c1
l3  12   8
l1   4   1

In [23]:
df.iloc[[2, 0], [3,0]]

    c4  c1
l3  12   8
l1   4   1